<template>
    <div class="index_header">
      <van-cell title="市区" :value="turnTo" @click="clickMore"/>
        <van-grid :column-num="4" v-if="isMore">
            <van-grid-item  :key="value"  text="杭州市" @click="turnToDetail(1)">
                <template #icon>
                    <img src="../../assets/home/logoImg/hangzhou.png" width="40" alt="">
                </template>
            </van-grid-item>
            <van-grid-item  :key="value" text="湖州市" @click="turnToDetail(2)">
                <template #icon>
                    <img src="../../assets/home/logoImg/huzhou.png" width="40" alt="">
                </template>
            </van-grid-item>
            <van-grid-item  :key="value"  text="嘉兴市" @click="turnToDetail(3)">
                <template #icon>
                    <img src="../../assets/home/logoImg/jiaxing.png" width="40" alt="">
                </template>
            </van-grid-item>
            <van-grid-item  :key="value" text="金华市" @click="turnToDetail(4)">
              <template #icon>
                    <img src="../../assets/home/logoImg/jinhua.png" width="40" alt="">
                </template>
            </van-grid-item>
            <van-grid-item  :key="value" text="丽水市" @click="turnToDetail(5)">
              <template #icon>
                    <img src="../../assets/home/logoImg/lishui.png" width="40" alt="">
                </template>
            </van-grid-item>
            <van-grid-item  :key="value"  text="宁波市" @click="turnToDetail(6)">
              <template #icon>
                    <img src="../../assets/home/logoImg/ningbo.png" width="40" alt="">
                </template>
            </van-grid-item>
            <van-grid-item  :key="value"  text="衢州市" @click="turnToDetail(7)">
              <template #icon>
                    <img src="../../assets/home/logoImg/quzhou.png" width="40" alt="">
                </template>
            </van-grid-item>
            <van-grid-item  :key="value"  text="绍兴市" @click="turnToDetail(8)">
              <template #icon>
                    <img src="../../assets/home/logoImg/shaoxing.png" width="40" alt="">
              </template>
            </van-grid-item>
        </van-grid>
         <van-grid :column-num="4"  v-if="!isMore">
            <van-grid-item  :key="value"  text="台州市" @click="turnToDetail(9)">
              <template #icon>
                    <img src="../../assets/home/logoImg/taizhou.png" width="40" alt="">
                </template>
            </van-grid-item>
            <van-grid-item  :key="value" text="温州市" @click="turnToDetail(10)">
                <template #icon>
                    <img src="../../assets/home/logoImg/wenzhou.png" width="40" alt="">
                </template>
            </van-grid-item>
            <van-grid-item  :key="value"  text="舟山市" @click="turnToDetail(11)">
              <template #icon>
                    <img src="../../assets/home/logoImg/zhoushan.png"  width="40" alt="">
                </template>
            </van-grid-item>
        </van-grid>
        <br>
        <van-cell title="百年历程" :value="turnMore" @click="getMore"/>
        <van-steps direction="vertical" :active="0" active-color="#c5464a" >
           <van-step v-if="!showMore">
            <h3>浙江嘉兴南湖的游船上通过了中国共产党的第一个纲领和第一个决议,宣告中国共产党的成立，这是中华民族发展史上开天辟地的大事变，中国革命从此出现全新的局面。</h3>
            <p> 1921年7月23日</p>
          </van-step>
          <van-step v-if="!showMore">
            <h3>萧山衙前农民在东岳庙召开大会，宣告成立衙前农民协会,衙前农民运动是中国共产党领导的第一次有组织有纲领的农民运动，揭开了中国现代农民革命斗争的序幕。</h3>
            <p> 1921年9月27日</p>
          </van-step>
          <van-step v-for="(step,index) in steps" v-if="showMore">
            <h3>{{ step.header }}</h3>
            <p> {{step.time}} </p>
          </van-step>
      </van-steps>
    </div>
</template>
<script>

export default {
    name:'IndexHeader',
    data(){
      return{
        isMore: true,
        turnTo:'下一页',
        turnMore: '更多',
        showMore:false,
        steps:[
          {header:'浙江嘉兴南湖的游船上通过了中国共产党的第一个纲领和第一个决议,宣告中国共产党的成立，这是中华民族发展史上开天辟地的大事变，中国革命从此出现全新的局面。',time:'1921年7月23日'},
          {header:'萧山衙前农民在东岳庙召开大会，宣告成立衙前农民协会,衙前农民运动是中国共产党领导的第一次有组织有纲领的农民运动，揭开了中国现代农民革命斗争的序幕。',time:'1921年9月27日'},
          {header:'社会主义青年团杭州支部成立。支部有团员27名，俞秀松任书记。这是全国最早建立的17处团组织之一。',time:'1922年4月19日'},
          {header:'中共中央执行委员会在杭州举行全体会议，讨论国共合作问题（史称“西湖会议”）。',time:'1922年8月29日至30日'},
          {header:'余姚庵东万余盐民大罢工获得胜利。余姚庵东盐民的罢工斗争，是浙江工人运动复兴的起点，也是全国工人运动从二七罢工之后的低潮走向复兴的重要标志之一。',time:'1924年7月'},
          {header:'宁绍台农民协会成立。',time:'1926年12月'},
          {header:'中共浙江省委在杭州正式成立。省委的建立，使浙江的党组织有了统一的领导机构，推动了大革命失败后全省党组织的恢复与发展。',time:'1927年6月'},
          {header:'中共浙西特委成立。',time:'1928年4月22日'},
          {header:'党组织在宁海县亭旁（现属三门县）农民经济斗争的基础上，举行武装暴动。26日，宣布成立亭旁区革命委员会。这是浙江省第一个苏维埃政权。后因起义队伍腹背受敌，弹尽援绝，暴动失败。',time:'1928年5月23日'},
          {header:'浙南特委成立，特委机关设在海门。12月，特委机关被破坏。',time:'1928年9月下旬'},
          {header:'党中央指示成立浙南特委和组建红军。',time:'1930年3月31日'},
          {header:'红十三军军部成立，红十三军是当时中央军委列入正式序列的全国14支红军之一。',time:'1930年5月初'},
          {header:'浙南第一次党代表大会召开。',time:'1930年6月18日至22日'},
          {header:'九一八事变爆发。19日，杭州学生开展了规模宏大的反日运动，开始组织抗日义勇军、“十人团”等。23日，杭州各界人士15万人冒雨举行了各界抗日救国市民大会。5天后，又成立“各界反日救国联合会”。',time:'1931年9月18日'},
          {header:'杭州特别支部成立。',time:'1932年6月'},
          {header:'中共浙江省临时工作委员会成立。',time:'1933年1月'},
          {header:'闽浙边临时省军区成立。',time:'1935年11月7日'},
          {header:'闽浙边临时省委决定建立浙南特委。',time:'1936年2月2日'},
          {header:'中共中央为了促进国共两党团结抗战，派周恩来与蒋介石在杭州就国共合作进行谈判。',time:'1937年3月下旬'},
          {header:'第二次国共合作在浙江正式形成，结束了红军挺进师在浙南的3年游击战争。',time:'1937年8月至9月'},
          {header:'中共浙江省临时工作委员会成立。',time:'1937年11月'},
          {header:'新四军第一、二、三支队在开化组编。',time:'1938年2月至4月'},
          {header:'周恩来视察浙江，对浙江党组织的发展方向作出了“巩固必须重于发展、质量必须重于数量”的重要指示。周恩来的浙江之行，对浙江党组织建设起到了积极推动作用。',time:'1939年3月17日至4月6日'},
          {header:'中共浙江省第一次代表大会在平阳县召开，中共浙江省第一次代表大会是新民主主义革命时期浙江党组织召开的唯一一次全省党代表大会。',time:'1939年7月21日至30日'},
          {header:'党中央决定开辟浙东战略基地，浦东抗日武装南渡到达浙东三北地区，展开抗日游击战。',time:'1941年2月1日'},
          {header:'浙东游击纵队对日大反攻，浙东抗日根据地面积进一步扩大，拥有400多万人口、1万多人的抗日武装，成为华中八大战略区之一和全国19块解放区之一。',time:'1945年8月'},
          {header:'全面内战爆发后，华中分局指示浙东党组织开展武装斗争，扩大活动地区。',time:'1946年9月20日'},
          {header:'杭州发生“于子三事件”，并在全国形成了“反迫害、争自由、求生存”的反蒋浪潮。',time:'1947年10月'},
          {header:'杭州解放',time:'1949年5月3日'},
          {header:'省委发出《为准备土地改革加强调查研究工作的指示》，浙江开始土地改革，到1952年春，除沿海少数岛屿的乡外，全省完成了土地改革。',time:'1950年1月29日'},
          {header:'省政府颁发《浙江省人民政府严禁鸦片烟毒令》，在全省开展禁烟禁毒工作。',time:'1950年4月13日'},
          {header:'浙江省首届各界人民代表会议在杭州举行',time:'1950年8月1日至8日'},
          {header:'省委召开全省第一次各界人民抗美援朝代表会议，深入开展抗美援朝运动。',time:'1951年10月9日至11日'},
          {header:'省委部署开展反对行贿、反对偷税漏税、反对盗骗国家财产、反对偷工减料和反对盗窃经济情报工作。',time:'1952年1月16日'},
          {header:'省委转发省财委《关于贯彻粮食计划供应的意见》。从11月开始，全省实行粮食统购统销。',time:'1953年10月31日'},
          {header:'省委发布《关于学习党在过渡时期的总路线总任务的计划》。',time:'1953年11月下旬'},
          {header:'毛泽东在杭州主持起草第一部《中华人民共和国宪法（草案）》。',time:'1953年12月28日至次年3月14日'},
          {header:'浙江省首届人民代表大会第一次会议在杭州召开，宣告人民代表大会制度在全省的建立。',time:'1954年8月13日至20日'},
          {header:'省委批示组成省人民武装委员会。',time:'1954年12月14日'},
          {header:'来自温台地区的227名青年，响应中国新民主主义青年团中央的号召，组成志愿垦荒队，开发大陈岛。',time:'1956年1月'},
          {header:'浙江国风昆苏剧团到北京演出昆剧《十五贯》，毛泽东、周恩来等党和国家领导人观看了演出。被称为“一出戏救活了一个剧种”。',time:'1956年4月19日'},
          {header:'中共浙江省第二次代表大会在杭州召开，大会通过《中国共产党浙江省第二次代表大会的决议》，选举产生中共浙江省第二届委员会。',time:'1956年7月1日至30日'},
          {header:'浙江省第一个五年计划全面完成。',time:'1957年'},
          {header:'毛泽东主席视察杭州市卫生模范居民区小营巷和浙江省农业科学研究所。',time:'1958年1月5日'},
          {header:'周恩来总理视察新安江水电站建设工程，并题词：“为我国第一座自己设计和自制设备的大型水力发电站的胜利建设而欢呼!”1960年4月22日，新安江水电站第一台发电机组开始发电。',time:'1959年4月9日'},
          {header:'中共浙江省第三次代表大会在杭州举行。',time:'1959年12月30日至1960年1月9日'},
          {header:'毛泽东主席视察金华双龙水电站，并把金华山“一垅八站”水电站作为全国发展农村小水电的典型加以推广。',time:'1960年3月14日'},
          {header:'衢州化工厂建成，填补了浙江有机化工和化肥工业的空白。',time:'1960年4月17日'},
          {header:'省委向各县传达中共中央《关于农村人民公社当前政策问题的紧急指示信》，对农村人民公社进行整顿。',time:'1960年11月4日'},
          {header:'省委发出《关于整顿县以上工矿企业劳动力的通知》，精减职工，减少城镇人口。',time:'1961年1月10日'},
          {header:'中共中央批复浙江省委关于行政区划的调整报告，同意恢复台州、舟山两个地委的建制。',time:'1962年4月12日'},
          {header:'中共中央同意成立浙江省丽水地委和丽水专署。',time:'1963年3月30日'},
          {header:'中共浙江省第四次代表大会在杭州召开。',time:'1963年4月11日至17日'},
          {header:'中共中央同意浙江省建立绍兴地委和绍兴专员公署。',time:'1964年9月5日'},
          {header:'省委、省人委决定关闭全省粮食市场，由国家设立粮食交易所。',time:'1964年12月15日'},
          {header:'国防部授予驻洞头某部六连军民联防模范连的光荣称号。',time:'1965年12月'},
          {header:'中央政治局扩大会议召开。会议通过“五一六通知”。8月，中共八届十一中全会通过《中国共产党中央委员会关于无产阶级文化大革命的决定》。这两次会议的召开，标志着“文化大革命”的全面发动。此后，浙江和全国一样，经历了十年“文化大革命”内乱。',time:'1966年5月4日至26日'},
          {header:'浙江省革命委员会和浙江省革命委员会党的核心小组正式成立。',time:'1968年3月24日'},
          {header:'省革委会动员全省知识青年奔赴农业生产第一线，全省掀起了知识青年上山下乡的高潮。',time:'1968年7月27日'},
          {header:'萧山县4万余农民奋战4个月，在瓜沥区的钱江涌潮带一举围涂3万余亩。此后连续几年，全县共围涂46万亩，开垦良田24万亩。',time:'1968年11月'},
          {header:'针对浙江省两派斗争尖锐的问题，中央召开关于解决浙江问题的“一月会议”。',time:'1969年1月8日至30日'},
          {header:'中共浙江省第五次代表大会在杭州召开。',time:'1971年1月20日至28日'},
          {header:'周恩来总理陪同美利坚合众国总统理查德·尼克松到杭州访问。27日上午，周恩来与尼克松在刘庄的八角亭草签了《中华人民共和国美利坚合众国联合公报》。',time:'1972年2月26日至27日'},
          {header:'河姆渡遗址被发现，随后开始考古挖掘工作。',time:'1973年6月'},
          {header:'省革委会根据国务院要求下达《关于改进财政管理体制的试行意见》，规定省对地区实行“收入按固定比例留成，超收适当分成，支出按指标包干，结余留归地方”的体制。',time:'1974年8月28日'},
          {header:'1月8日 周恩来总理逝世。全省人民以杭州为中心，自发举行悼念周恩来的活动。',time:'1976年3月底至4月'},
          {header:'省委决定建立浙江省宁波港、浙江炼油厂、镇海发电厂、镇海清水浦渔业基地建设工程会战领导小组。',time:'1976年6月8日'},
          {header:'浙江开始平反冤假错案。到1982年底，大规模的平反冤假错案工作基本结束。到1987年上半年，全省落实政策工作基本结束。',time:'1976年1976年'},
          {header:'省委召开全省科学技术动员大会，要求各地加强对科技工作的领导，恢复和健全科研工作领导机构。',time:'1977年6月23日'},
          {header:'国务院决定，从当年起恢复“文化大革命”中被废弃的高考制度。之后，浙江省组织了全省自愿报名、统一考试、择优录取的高考工作。',time:'1977年10月12日'},
          {header:'中共浙江省第六次代表大会在杭州举行。',time:'1978年5月25日至29日'},
          {header:'国务院正式批准开放宁波港。',time:'1978年12月4日'},
          {header:'省革委会发出《关于统筹解决知识青年问题的通知》，全省开始全面落实知识青年政策。知青开始大批返城。至1981年底，省内下乡知青99%以上得到适当安排。',time:'1979年2月6日'},
          {header:'省革委会发出《关于对四类分子摘帽审批手续的通知》，对地主、富农、反革命和坏分子的摘帽工作全面展开。到1984年底，24万余人全部摘帽。',time:'1979年2月7日'},
          {header:'省革委会发出《关于扩大国营工业企业经营管理自主权试点的暂行办法》，确定了74个全民所有制工业企业试点单位。',time:'1979年10月4日'},
          {header:'长兴县长城公社狄家㘰大队实行“联产到劳”。在此前后，全省其他地区也相继开始实行大田作物包产到户、包干到户的经营责任制。至1984年春，全省农村99%以上的农户实行联产承包责任制。',time:'1979年11月'},
          {header:'省工商局发出《关于发展城镇个体工商户登记发证管理的意见》。同月11日，温州市民章华妹从温州鼓楼工商所领到了营业执照，被媒体称为中国第一张“个体工商户营业执照”。',time:'1980年12月5日'},
          {header:'省委下发《关于发展农村多种经营若干问题的通知》，要求全省农村贯彻农林牧副渔五业并举的方针，发展多种经营。',time:'1981年7月30日'},
          {header:'经中共中央、国务院批准，温州地区与温州市合并，建立温州市委、市人民政府。',time:'1981年9月22日'},
          {header:'义乌县政府正式开放稠城镇小百货市场，义乌县第一代小商品市场开业，市场设摊位700个。',time:'1982年9月5日'},
          {header:'温岭县社队企业局批复同意该县牧屿镇以合股形式创办温岭县牧南工艺品厂，这是全国首家由工商行政部门核发营业执照的股份合作制企业。',time:'1982年12月28日'},
          {header:'省委召开工作会议，部署改革“政社合一”乡村基层组织体制。到1984年底，全省完成了政社分设工作，共建立2999个乡、243个镇。',time:'1983年1月4日至22日'},
          {header:'省六届人大一次会议在杭州召开。',time:'1983年4月22日至28日'},
          {header:'宁波市、温州市被中共中央、国务院批准为全国首批沿海开放城市。至1992年，随着金华、衢州两市区和丽水市的开放，浙江全省实行对外开放。',time:'1984年5月4日'},
          {header:'全省唯一的少数民族自治县——景宁畲族自治县设立。',time:'1984年6月20日'},
          {header:'务院批准在小港兴办宁波经济技术开发区。1992年11月，宁波经济技术开发区与北仑港工业区的重点开发区域合并，统称宁波经济技术开发区。24日，宁波保税区成立。',time:'1984年10月18日'},
          {header:'国务院决定宁波市、湖州市为全国经济体制综合改革试点城市。龙港建起了“中国第一座农民城”。',time:'1984年11月'},
          {header:'国务院批准撤销金华地区，金华市、衢州市分别升级为地级市。',time:'1985年5月15日'},
          {header:'浙江省首次出口商品交易会在杭州举行，成交额超过1亿美元。',time:'1986年6月25日至7月4日'},
          {header:'国务院批准撤销舟山地区，设立舟山市（地级）。',time:'1987年1月23日'},
          {header:'温州市被国务院列入全国首批农村改革试验区之一。',time:'1987年9月16日'},
          {header:'杭州考古发现南宋遗址。',time:'1988年6月7日'},
          {header:'省委办公厅发出通知，开展农村形势教育。此后十年，全省每年根据实际情况，确定一个主题，集中一到两个月的时间，在广大农村组织党的基本路线教育。',time:'1988年11月26日'},
          {header:'浙江凤凰化工股份有限公司成立并获准上市，成为中国第8只股票，即史称“老八股”之一。',time:'1988年12月'},
          {header:'桐乡县通过初级农村电气化验收，成为全国第一个农村初级电气化县。',time:'1989年10月30日'},
          {header:'国务院批准建立杭州高新技术产业开发区。',time:'1991年3月6日'},
          {header:'省政府下达《关于进一步办好城乡市场的通知》。到1993年后，浙江专业市场总成交额、单个市场成交额连续保持全国第一，“市场大省”从此声名远扬。',time:'1991年7月15日'},
          {header:'国家计委批准在浙江省安吉县兴建天荒坪抽水蓄能电站。',time:'1991年9月3日'},
          {header:'杭甬高速公路杭州至萧山段建成。1996年11月，全线竣工，这是浙江首条高速公路。',time:'1991年11月20日'},
          {header:'中国第一座自行设计、建造的核电站——秦山核电站并网发电，投入试运行。',time:'1991年12月15日'},
          {header:'浙江中大集团股份有限公司成立，这是浙江省首家外贸股份制公司。',time:'1992年9月18日'},
          {header:'全国首家乡镇企业集团——东阳横店集团成立。',time:'1993年3月1日'},
          {header:'国务院批准设立杭州经济技术开发区。',time:'1993年4月4日'},
          {header:'乌溪江引水工程正式通水，它的建成解决了衢州南部地区55万亩农田严重干旱缺水的问题。',time:'1994年8月4日'},
          {header:'国务院批准撤销台州地区，设立地级台州市。',time:'1994年8月22日'},
          {header:'省委办公厅、省政府办公厅发出《关于建立首批省级爱国主义教育基地的通知》，浙江省革命烈士纪念馆等30个单位列为首批省级爱国主义教育基地。',time:'1995年2月10日'},
          {header:'省委发出《关于在全省党员中开展建设有中国特色社会主义理论和党章学习活动的实施意见》，对全省党员学理论学党章的“双学”活动进行全面部署。',time:'1995年4月8日'},
          {header:'浙江省暨绍兴市各界在绍兴禹王庙首次公祭大禹陵。',time:'1995年4月20日'},
          {header:'浙赣铁路复线全线开通运营。',time:'1996年1月26日'},
          {header:'浙江省行政村实现村村通电。',time:'1996年10月25日'},
          {header:'全省县以上机关国家公务员考试录用制度启动。',time:'1996年12月5日'},
          {header:'浙江沪杭甬高速公路股份有限公司在香港联合交易所挂牌交易，这是全省第一家在境外上市的企业。',time:'1997年5月15日'},
          {header:'省委、省政府下发《关于进一步做好减轻农民负担工作的通知》。',time:'1997年10月15日'},
          {header:'省委下发《中共浙江省委、浙江省人民政府关于大力发展个体私营等非公有制经济的通知》。',time:'1998年1月4日'},
          {header:'国家批准兴建的中国首条中外合资铁路——金温铁路全线正式运营。',time:'1998年6月11日'},
          {header:'新浙江大学成立大会在杭州举行。',time:'1998年9月15日'},
          {header:'999年度浙江投资贸易洽谈会在宁波举行。此后，每年一届的浙江省投资贸易洽谈会均在宁波举行。',time:'1999年6月8日至12日'},
          {header:'省委、省政府作出《关于实施新世纪人才工程的决定》。',time:'1999年12月10日'},
          {header:'省委、省政府出台《浙江省城市化发展纲要》。',time:'1999年12月22日'},
          {header:'省委、省政府作出《关于进一步扩大对外开放加快发展开放型经济的决定》。',time:'2000年1月26日'},
          {header:'经国务院批准，丽水地区撤销地区建制和县级丽水市，设立地级丽水市和莲都区。',time:'2000年6月6日'},
          {header:'省委十届四次全会提炼了“自强不息、坚韧不拔、勇于创新、讲求实效”的浙江精神。',time:'2000年7月'},
          {header:'时隔71年后再次举办的西湖博览会在杭州举行开幕式。',time:'2000年10月20日'},
          {header:'上（虞）三（门）高速公路全线贯通。',time:'2000年12月26日'},
          {header:'省委、省政府出台《关于进一步促进农业增效农民增收的若干政策意见》。',time:'2001年1月6日'},
          {header:'“浙江论坛”2001年度首场报告会在浙江图书馆举行。这是省委首次举办“浙江论坛”。此后，每年不定期举办若干次。',time:'2001年2月22日'},
          {header:'全国最大的海水淡化示范工程建设基地在嵊泗县菜园镇建成。',time:'2001年7月17日'},
          {header:'省政府出台《浙江省最低生活保障办法》，自当年10月1日起施行。',time:'2001年8月15日'},
          {header:'浙江在全省范围内实行农村税费改革。',time:'2002年7月1日'},
          {header:'省委召开领导干部会议，宣布中共中央决定：习近平任浙江省委副书记，提名为省长候选人。同日，省第九届人民代表大会常务委员会第三十八次会议决定：习近平任浙江省副省长、代省长。',time:'2002年10月12日'},
          {header:'省委召开领导干部会议，宣布中共中央决定：习近平任浙江省委书记。',time:'2002年11月21日'},
          {header:'浙江的所有企业和与其形成劳动合同关系的职工、城镇个体劳动者，都开始参加职工基本养老保险。',time:'2002年12月1日'},
          {header:'省委十一届二次全体（扩大）会议审议并通过《中共浙江省委关于认真贯彻落实党的十六大精神，加快全面建设小康社会，提前基本实现现代化的决定》。',time:'2002年12月18日至19日'},
          {header:'杭金衢和金丽高速公路建成通车。至此，浙江省实现“4小时公路交通圈”。',time:'2002年12月28日'},
          {header:'经国家环保总局批准，浙江省成为全国第五个生态省建设试点省份。',time:'2003年1月'},
          {header:'省委召开常委扩大会议，传达贯彻全国非典型性肺炎防治工作会议精神，研究部署浙江的“非典”防治工作。20日，浙江首次发现输入性“非典”病例。防治工作至6月初取得了阶段性成果。',time:'2003年4月14日'},
          {header:'省委决定开展“千村示范、万村整治”工作，对浙江1万个左右的村进行全面整治，把其中1000个左右的中心村建设成全面小康示范村。2018年，“千万工程”获得联合国“地球卫士奖”。',time:'2003年6月5日至6日'},
          {header:'省委、省政府召开全省工业大会，提出坚持走新型工业化道路，加快浙江先进制造业基地建设。',time:'2003年6月25日'},
          {header:'省委、省政府召开生态省建设动员大会，全面启动生态省建设，努力打造“绿色浙江”。',time:'2003年7月11日'},
          {header:'省委、省政府召开全省海洋经济工作会议，提出建设海洋经济强省的目标。',time:'2003年8月18日'},
          {header:'西气东输工程浙江段全线贯通。',time:'2003年11月23日'},
          {header:'省委、省政府出台《关于进一步扩大开放的若干意见》，提出实施从“外贸大省”向“开放大省”的跨越。',time:'2004年4月21日'},
          {header:'省委十一届六次全体（扩大）会议通过《中共浙江省委关于建设“平安浙江”促进社会和谐稳定的决定》。',time:'2004年5月10日至11日'},
          {header:'省委、省政府在全省经济工作会议上宣布：从2005年开始，浙江全面停征农业税。',time:'2004年12月20日'},
          {header:'省委在全省党员中开展以实践“三个代表”重要思想为主要内容的保持共产党员先进性教育活动。',time:'2005年1月18日'},
          {header:'省委、省政府在全国率先制定并实施《浙江省统筹城乡发展 推进城乡一体化纲要》。',time:'2005年1月'},
          {header:'首届中国国际动漫节在杭州举办。',time:'2005年5月31日至6月5日'},
          {header:'习近平同志在《光明日报》发表文章《弘扬“红船精神” 走在时代前列》，首次提出“红船精神”，并将其概括为开天辟地、敢为人先的首创精神，坚定理想、百折不挠的奋斗精神，立党为公、忠诚为民的奉献精神。',time:'2005年6月21日'},
          {header:'习近平在湖州安吉余村考察时提出了“绿水青山就是金山银山”理念。',time:'2005年8月15日'},
          {header:'习近平在《浙江日报》发表《与时俱进的浙江精神》的文章，提出要与时俱进地培育和弘扬“求真务实、诚信和谐、开放图强”的浙江精神。',time:'2006年2月5日'},
          {header:'省委、省政府作出《关于全面推进社会主义新农村建设的决定》。',time:'2006年4月25日'},
          {header:'省委、省政府发出通知，决定在全省学习推广义乌市推进全面建设小康社会、走科学发展之路的经验。',time:'2006年4月30日'},
          {header:'省委、省政府发布《关于推进“品牌大省”建设的若干意见》。',time:'2006年6月12日'},
          {header:'省委十一届十一次全体（扩大）会议审议并通过了《中共浙江省委关于认真贯彻党的十六届六中全会精神，构建社会主义和谐社会的意见》。',time:'2006年11月13日至15日'},
          {header:'省政府下发《关于实施义务教育经费保障机制改革的通知》，要求全部免除义务教育阶段学生杂费。',time:'2007年1月31日'},
          {header:'省委十二届二次全体（扩大）会议在杭州举行，全会审议通过了《中共浙江省委关于认真贯彻党的十七大精神，扎实推进创业富民创新强省的决定》。',time:'2007年11月5日至6日'},
          {header:'国务院正式批准设立宁波梅山保税港区。',time:'2008年2月24日'},
          {header:'当时世界上最长的跨海大桥——杭州湾跨海大桥试运营通车。',time:'2008年5月1日'},
          {header:'省委常委会召开紧急会议，研究部署支援四川地震灾区工作。此前12日，四川省汶川县发生8.0级强震。',time:'2008年5月13日'},
          {header:'舟山跨海大桥正式通车。舟山跨海大桥全长48.16公里，是当时世界规模最大的岛陆联结工程。',time:'2009年12月25日'},
          {header:'全省60周岁以上的老人，可以享受由政府提供的基础养老金。浙江由此成为全国所有省区中率先实现养老保险全覆盖的省份。',time:'2010年1月1日'},
          {header:'国务院批复《浙江海洋经济发展示范区规划》，这是浙江首个国家发展战略规划，也是全国第一个海洋经济示范区规划。',time:'2011年2月25日'},
          {header:'国务院批复《浙江省义乌市国际贸易综合改革试点总体方案》。这是全国首个由国务院批准的县级市综合改革试点。',time:'2011年3月4日'},
          {header:'“西湖文化景观”入选《世界遗产名录》，成为浙江首个世界文化遗产。',time:'2011年6月24日'},
          {header:'国务院正式批准设立舟山群岛新区。',time:'2011年6月30日'},
          {header:'省委、省政府出台《关于加快培育发展战略性新兴产业的实施意见》。',time:'2011年8月1日'},
          {header:'首届世界浙商大会在杭州举行。会上发布了《首届世界浙商大会宣言》。',time:'2011年10月25日至30日'},
          {header:'省政府召开新闻发布会，宣布国务院正式批准设立舟山港综合保税区。',time:'2012年10月11日'},
          {header:'浙江省首条地铁——杭州地铁1号线开通试运行。',time:'2012年11月24日'},
          {header:'省十二届人大一次会议和省政协十一届一次会议在杭州召开.',time:'2013年1月'},
          {header:'经国务院同意，国家发改委批复《浙江嘉善县域科学发展示范点建设方案》。',time:'2013年2月28日'},
          {header:'浙江启动以权力清单为基础的“三张清单一张网”建设，2014年7月，在全国率先部署责任清单，形成“四张清单一张网”。',time:'2013年11月'},
          {header:'浙江正式公布实施《关于修改浙江省人口与计划生育条例第十九条的决定》，成为全国首个通过修改计划生育地方性法规、将“单独两孩”政策予以落地的省份。',time:'2014年1月17日'},
          {header:'浙江出台全国首个美丽乡村省级地方标准。',time:'2014年4月6日'},
          {header:'首趟“义新欧”中欧货运班列开行，从义乌铁路西站开行抵达西班牙马德里，全程13052公里。',time:'2014年11月18日'},
          {header:'首届世界互联网大会在桐乡乌镇举办，会上，乌镇获颁“世界互联网大会永久会址”标牌。',time:'2014年11月19日至21日'},
          {header:'《浙江省社会养老服务促进条例》施行。这是全国首部由人代会通过的社会养老服务地方性法规。',time:'2015年3月1日'},
          {header:'国务院批准杭州设立跨境电子商务综合试验区。',time:'2015年3月7日'},
          {header:'省委召开浙江省“三严三实”专题教育部署会。全省“三严三实”专题教育启动。',time:'2015年5月7日'},
          {header:'习近平在党的十八大后首次到浙江考察，对浙江工作赋予“干在实处永无止境，走在前列要谋新篇”的新使命。6月10日至12日，省委十三届七次全会在杭州举行。全会深入学习习近平在浙江考察时的重要讲话精神，对贯彻落实习近平重要讲话精神进行研究部署。',time:'2015年5月25日至27日'},
          {header:'浙江开始全面实行“五证合一”登记制度。9月29日，发出首批“一照一码”营业执照。',time:'2015年月1日'},
          {header:'杭州获得2022年亚运会承办权。',time:'2015年9月16日'},
          {header:'第二届世界互联网大会在桐乡乌镇开幕，习近平出席开幕式并发表主旨演讲。',time:'2015年12月16日'},
          {header:'省委举行“两学一做”专题教育部署会，全省“两学一做”学习教育活动正式启动。',time:'2016年4月18日'},
          {header:'省委经济工作会议提出“最多跑一次”改革。此后，“最多跑一次”改革在全省推开。',time:'2016年12月'},
          {header:'浙江启动国家标准化综合改革试点。',time:'2017年1月'},
          {header:'省政府批复设立宁波“一带一路”建设综合试验区。',time:'2017年9月5日'},
          {header:'习近平带领新当选的十九届中央政治局常委从上海来到浙江嘉兴南湖边，瞻仰复建的南湖红船，并参观南湖革命纪念馆，回顾建党历史，重温入党誓词，宣示新一届党中央领导集体的坚定政治信念。习近平发表重要讲话强调，只有不忘初心、牢记使命、永远奋斗，才能让中国共产党永远年轻。',time:'2017年10月31日'},
          {header:'省委经济工作会议部署实施数字经济“一号工程”，深化数字浙江建设。',time:'2017年12月25日'},
          {header:'省委、省政府出台《关于全面开展扫黑除恶专项斗争的通知》。决定自2018年起至2020年，在全省范围内开展为期三年的扫黑除恶专项斗争。',time:'2018年2月11日'},
          {header:'浙江红船干部学院和红船精神研究院成立。',time:'2018年4月9日'},
          {header:'省委出台《关于开展“不忘初心、牢记使命”主题教育的实施意见》。此次主题教育自上而下分两批进行，至11月底基本结束。翌年1月9日，全省“不忘初心、牢记使命”主题教育总结大会在杭州召开。',time:'2019年6月4日'},
          {header:'良渚古城遗址申遗成功。',time:'2019年7月6日'},
          {header:' 龙丽温高速文瑞段、文泰先行段通车，标志着文成、泰顺无高速公路的历史正式结束，浙江陆域实现“县县有高速”。',time:'2020年1月1日'},
          {header:'习近平在浙江就统筹推进新冠肺炎疫情防控和经济社会发展工作进行调研。对浙江提出“努力成为新时代全面展示中国特色社会主义制度优越性的重要窗口”的新目标新定位。',time:'2020年3月29日至4月1日'},
          {header:'省委召开全省数字化改革大会，全面部署浙江数字化改革工作。袁家军在会上强调，加快建设数字浙江，推进全省改革发展各项工作在新起点上实现新突破，为争创社会主义现代化先行省开好局、起好步。',time:'2021年2月18日'}
        ]
      }
    },
    methods:{
      clickMore(){
        this.isMore=!this.isMore
         var turn=this.turnTo
        if(this.isMore == true){
            turn='下一页'
        }else{
            turn='上一页'
        }
        this.turnTo=turn
      },
      getMore(){
        this.showMore=!this.showMore
        if(this.turnMore=='更多'){
          this.turnMore='收缩'
        }else{
          this.turnMore='更多'
        }
      },
      turnToDetail(val){
        this.$router.push({
          path: '/city',
          query: {
            cId: val
          }
        })
      }
    },
    created(){
      
    }
}
</script>
<style scoped>

</style>